app/controllers/photos/likes_controller.rb

INSERT INTO "photo_likes" ("created_at", "updated_at", "user_id", "photo_id") VALUES ('2026-04-21 17:20:43.927126', '2026-04-21 17:20:43.927126', 1, 1) RETURNING "id"
SELECT "photo_likes".* FROM "photo_likes" WHERE "photo_likes"."photo_id" = 1 AND "photo_likes"."user_id" = 1 LIMIT 1
---
  def create
    @photo.photo_likes.find_or_create_by user: current_user

DELETE FROM "photo_likes" WHERE "photo_likes"."id" = 1
SELECT "photo_likes".* FROM "photo_likes" WHERE "photo_likes"."photo_id" = 1 AND "photo_likes"."user_id" = 1 LIMIT 1
---
  def destroy
    @photo.photo_likes.find_by(user: current_user)&.destroy

SELECT "photos".* FROM "photos" WHERE "photos"."id" = 1 LIMIT 1
---
  def get_photo
    @photo = Photo.find params[:photo_id]